Revit 2027 API
DocumentChangedEventArgs.Operation Property
 The operation associated with this event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UndoOperation Operation { get; }
Public ReadOnly Property Operation As UndoOperation
	Get
public:
property UndoOperation Operation {
	UndoOperation get ();
}
member Operation : UndoOperation with get
Property Value
UndoOperation
See Also
Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace